
a='''
Дан файл, каждая строка которого может содержать одно или несколько целых чисел, разделенных одним или несколькими пробелами.
Вычислите сумму чисел в каждой строке и выведите эти суммы через пробел (для каждой строки выводится сумма чисел в этой строке).
В этой задаче вам нужно подсчитать ответ для данного входного файла. Ссылка на входной файл: https://stepik.org/media/attachments/lesson/258917/input.txt

Например, если бы содержимое входного файла было следующим:
2 2
 3    4
 1       5

то в качестве ответа необходимо было бы сдать последовательность чисел
4 7 6
'''
f_in=open('input6-1-3.txt','r',encoding='utf8')
for line in f_in:
    s=sum(map(int,line.split()))
    print(s, end=' ')
f_in.close()