"""
Теперь вам опять нужно сдать на проверку программу,
которая будет печатать "123424242143132324326922342152 + 213732174232497412039472189472409 = x" (без кавычек),
где x - результат вычисления, посчитанный прямо в программе.

Эта задача предназначена для того, чтобы вы научились различать числа и строки, состоящие из цифр,
а также научились выводить несколько значений разного типа в одном print, правильно работая с разделителями.

Чтобы вам было интереснее, мы сделали пример неправильным,
так что не стоит пытаться его скопировать в текст программы и сдать,
он отражает только формат вывода :)

Sample Input:

Sample Output:

123424242143132324326922342152 + 213732174232497412039472189472409 = 214855698474540544343799111814561
"""
a=123424242143132324326922342152
b=213732174232497412039472189472409
print(f'{a} + {b} = {a+b}')