"""
Теперь мы научимся сдавать на проверку программу.
Вам необходимо написать программу, которая будет выводить на экран Hello world
Для сдачи решения вам необходимо скопировать код программы,
выводящей Hello world в окно для ввода решения.
Обратите внимание, что здесь нужно сдать именно программу, выводящую текст, а не просто текст.
Обязательно соблюдайте регистр (большие и маленькие буквы различаются) и не выводите абсолютно ничего лишнего -
только два слова и пробел между ними.

Sample Input:

Sample Output:
Hello world
"""
print('Hello world')